wsd1/LCD-NV3007-142x428-mjpg-decode/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.1.0 Project Minimal Configuration
#
# default:
CONFIG_IDF_TARGET="esp32s3"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_ESP_H264_DECODER_IRAM=n
CONFIG_VIDEO_ENCODER_SW_H264_SUPPORT=n
CONFIG_VIDEO_ENCODER_SW_MJPEG_SUPPORT=n
